//0. Вывести квадрат числа
//Написал второй вариант программы, с участием пользователя
Console.WriteLine("Введите число которое хотите возвести в квадрат, в случае если число дробное в качестве разделителя используйте запятую :");
double numberA = double.Parse(Console.ReadLine()!);
Console.WriteLine("Квадрат заданого числа равен :" + numberA*numberA);